In [17]:
import numpy as np
import pandas as pd

## 1.Open
### Open oznacza cenę, po której rozpoczęto handel akcjami.
## 2.Close
### Close oznacza cenę, z którą kończą się akcje.
## 3.High
### High to najwyższa cena, po której handlowano akcjami w danym okresie.
## 4.Low
### Low to najniższa cena w danym okresie.
## 5.Volume
### Volume to całkowita liczba akcji będących przedmiotem obrotu w danym okresie. 
## 6.Adjusted close
### Adjusted close  to cena zamknięcia po korektach uwzględniających wszystkie stosowne podziały i wypłaty dywidendy.

In [18]:
df =pd.read_csv('11B Stock.csv')
df.head()

         Date  Open  High   Low  Close  Adj Close   Volume
0  2011-01-12  8.01  8.05  8.00   8.01       8.01   1435.0
1  2011-01-13  7.90  8.25  7.90   8.10       8.10    802.0
2  2011-01-14  8.00  8.00  7.65   7.95       7.95   2955.0
3  2011-01-17  7.99  9.50  7.95   9.05       9.05  20156.0
4  2011-01-18  9.05  9.05  8.31   8.72       8.72   4897.0

In [19]:
df.tail()

,Date,Open,High,Low,Close,Adj Close,Volume
2788,2021-10-11,424.000000,428.799988,418.799988,420.600006,420.600006,5215.0
2789,2021-10-12,421.000000,423.799988,412.799988,413.000000,413.000000,7547.0
2790,2021-10-13,418.000000,420.600006,414.600006,419.600006,419.600006,1111.0
2791,2021-10-14,419.399994,427.799988,419.399994,425.000000,425.000000,3236.0
2792,2021-10-15,423.000000,427.200012,418.399994,418.399994,418.399994,1440.0

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2793 entries, 0 to 2792
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       2793 non-null   object
 1   Open       2792 non-null   float64
 2   High       2792 non-null   float64
 3   Low        2792 non-null   float64
 4   Close      2792 non-null   float64
 5   Adj Close  2792 non-null   float64
 6   Volume     2792 non-null   float64
dtypes: float64(6), object(1)
memory usage: 152.9+ KB

## Sprawdzamy czy są jakieś puste wartości. Jeśli są to usuwamy je.

In [21]:
df.isnull().sum()

Date         0
Open         1
High         1
Low          1
Close        1
Adj Close    1
Volume       1
dtype: int64

In [22]:
df[df["Open"].isnull()]

            Date  Open  High  Low  Close  Adj Close  Volume
2696  2021-06-03   NaN   NaN  NaN    NaN        NaN     NaN

In [23]:
df = df.dropna()

In [24]:
df.describe()

,Open,High,Low,Close,Adj Close,Volume
count,2792.000000,2792.000000,2792.000000,2792.000000,2792.000000,2792.000000
mean,179.352027,182.266372,175.951383,179.175938,179.175938,7414.805158
std,183.325923,186.236389,179.909131,183.025964,183.025964,13603.277530
min,6.750000,7.000000,6.200000,6.820000,6.820000,0.000000
25%,10.675000,10.972500,10.350000,10.697500,10.697500,1307.750000
50%,77.815002,79.150002,75.450001,77.930000,77.930000,3919.000000
75%,368.000000,374.000000,355.125000,363.500000,363.500000,8107.500000
max,616.000000,619.000000,593.000000,604.000000,604.000000,208600.000000

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2792 entries, 0 to 2792
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       2792 non-null   object
 1   Open       2792 non-null   float64
 2   High       2792 non-null   float64
 3   Low        2792 non-null   float64
 4   Close      2792 non-null   float64
 5   Adj Close  2792 non-null   float64
 6   Volume     2792 non-null   float64
dtypes: float64(6), object(1)
memory usage: 174.5+ KB

## Trzeba zmienić typ columny "Date". Zmieniamy dtype "object" na "Datetime"

In [26]:
df["Date"] = pd.to_datetime(df["Date"])
df.Date.dtype

dtype('<M8[ns]')

In [27]:
## Teraz columne "Date" zamieniamy na index. Pozwoli nam to na zrobienie wizualizacji

In [28]:
df.set_index("Date", inplace=True)

In [29]:
df.head()

            Open  High   Low  Close  Adj Close   Volume
Date
2011-01-12  8.01  8.05  8.00   8.01       8.01   1435.0
2011-01-13  7.90  8.25  7.90   8.10       8.10    802.0
2011-01-14  8.00  8.00  7.65   7.95       7.95   2955.0
2011-01-17  7.99  9.50  7.95   9.05       9.05  20156.0
2011-01-18  9.05  9.05  8.31   8.72       8.72   4897.0

In [30]:
bit_stock= df.copy()
bit_stock

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2011-01-12,8.010000,8.050000,8.000000,8.010000,8.010000,1435.0
2011-01-13,7.900000,8.250000,7.900000,8.100000,8.100000,802.0
2011-01-14,8.000000,8.000000,7.650000,7.950000,7.950000,2955.0
2011-01-17,7.990000,9.500000,7.950000,9.050000,9.050000,20156.0
2011-01-18,9.050000,9.050000,8.310000,8.720000,8.720000,4897.0
...,...,...,...,...,...,...
2021-10-11,424.000000,428.799988,418.799988,420.600006,420.600006,5215.0
2021-10-12,421.000000,423.799988,412.799988,413.000000,413.000000,7547.0
2021-10-13,418.000000,420.600006,414.600006,419.600006,419.600006,1111.0
2021-10-14,419.399994,427.799988,419.399994,425.000000,425.000000,3236.0
2021-10-15,423.000000,427.200012,418.399994,418.399994,418.399994,1440.0

In [31]:
%store bit_stock

Stored 'bit_stock' (DataFrame)